RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_rcu.c
/*!
    \brief      configure the CK_OUT0 clock source and divider (API_ID(0x0011U))
    \param[in]  ckout0_src: CK_OUT0 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT0SRC_IRC64MDIV: IRC64M selected
      \arg        RCU_CKOUT0SRC_LXTAL: LXTAL selected
      \arg        RCU_CKOUT0SRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUT0SRC_PLL0P: PLL0P selected
      \arg        RCU_CKOUT0SRC_IRC48M: IRC48M selected
      \arg        RCU_CKOUT0SRC_PER: PER selected
      \arg        RCU_CKOUT0SRC_USBHS060M: USBHS0 60M selected
      \arg        RCU_CKOUT0SRC_USBHS160M: USBHS1 60M selected
    \param[in]  ckout0_div: CK_OUT0 divider
      \arg        RCU_CKOUT0_DIVx (x = 1,2,3,...15): CK_OUT0 is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout0_config(uint32_t ckout0_src, uint32_t ckout0_div)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_CKOUT0_SOURCE(ckout0_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKOUT0_DIVIDER(ckout0_div)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0011U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_CFG2;
        /* reset the CKOUT0SRC, CKOUT0DIV and set according to ckout0_src and ckout0_div */
        reg &= ~(RCU_CFG2_CKOUT0SEL | RCU_CFG2_CKOUT0DIV);
        RCU_CFG2 = (reg | ckout0_src | ckout0_div);
    }
}

/*!
    \brief      configure the CK_OUT1 clock source and divider (API_ID(0x0012U))
    \param[in]  ckout1_src: CK_OUT1 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CKOUT1SRC_SYSTEMCLOCK: system clock selected
      \arg        RCU_CKOUT1SRC_PLL1R: PLL1R selected
      \arg        RCU_CKOUT1SRC_HXTAL: HXTAL selected
      \arg        RCU_CKOUT1SRC_PLL0P: PLL0P selected
      \arg        RCU_CKOUT1SRC_LPIRC4M: LPIRC4M selected
      \arg        RCU_CKOUT1SRC_IRC32K: IRC32K selected
      \arg        RCU_CKOUT1SRC_PLL2R: PLL2R selected
    \param[in]  ckout1_div: CK_OUT1 divider
      \arg        RCU_CKOUT1_DIVx (x = 1,2,3,....15): CK_OUT1 is divided by x
    \param[out] none
    \retval     none
*/
void rcu_ckout1_config(uint32_t ckout1_src, uint32_t ckout1_div)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_CKOUT1_SOURCE(ckout1_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else if(NOT_RCU_CKOUT1_DIVIDER(ckout1_div)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_CFG2;
        /* reset the CKOUT1SRC, CKOUT1DIV and set according to ckout1_src and ckout1_div */
        reg &= ~(RCU_CFG2_CKOUT1SEL | RCU_CFG2_CKOUT1DIV);
        RCU_CFG2 = (reg | ckout1_src | ckout1_div);
    }
}

/*!
    \brief      configure the pll input and output clock range (API_ID(0x0013U))
    \param[in]  pll_idx: IDX_PLL, IDX_PLLx (x = 0,1,2)
    \param[in]  ck_input: input clock range
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLxRNG_1M_2M (x = 0,1,2): input clock frequency: 1-2MHz
      \arg        RCU_PLLxRNG_2M_4M (x = 0,1,2): input clock frequency: 2-4MHz
      \arg        RCU_PLLxRNG_4M_8M (x = 0,1,2): input clock frequency: 4-8MHz
      \arg        RCU_PLLxRNG_8M_16M: input clock frequency: 8-16MHz
     \param[in]  ck_output: output clock range
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLLxVCO_192M_836M (x = 0,1,2): select wide VCO, range: 192-836MHz
      \arg        RCU_PLLxVCO_150M_420M (x = 0,1,2): select narrow VCO, range: 150-420MHz
    \param[out] none
    \retval     none
*/
void rcu_pll_input_output_clock_range_config(pll_idx_enum pll_idx, uint32_t ck_input, uint32_t ck_output)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLL_INPUT_CLOCKK_RANGE(ck_input)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else if(NOT_RCU_PLL_OUTPUT_CLOCKK_RANGE(ck_output)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(pll_idx) {
        case IDX_PLL0:
            /* reset the PLLRNG/PLLVCOSEL bits and set according to ck_input/ck_output */
            RCU_PLLALL &= ~(RCU_PLLALL_PLL0RNG | RCU_PLLALL_PLL0VCOSEL);
            RCU_PLLALL |= (ck_input | ck_output);
            break;
        case IDX_PLL1:
            /* reset the PLLRNG/PLLVCOSEL bits and set according to ck_input/ck_output */
            RCU_PLLALL &= ~(RCU_PLLALL_PLL1RNG | RCU_PLLALL_PLL1VCOSEL);
            RCU_PLLALL |= (ck_input | ck_output);
            break;
        case IDX_PLL2:
            /* reset the PLLRNG/PLLVCOSEL bits and set according to ck_input/ck_output */
            RCU_PLLALL &= ~(RCU_PLLALL_PLL2RNG | RCU_PLLALL_PLL2VCOSEL);
            RCU_PLLALL |= (ck_input | ck_output);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure fractional part of the multiplication factor for PLL VCO (API_ID(0x0014U))
    \param[in]  pll_idx: IDX_PLL, IDX_PLLx (x = 0,1,2)
    \param[in]  pll_fracn: fractional part of the multiplication factor
      \arg        this parameter should be selected between 0 and 8191
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_config(pll_idx_enum pll_idx, uint32_t pll_fracn)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLL_FRACN(pll_fracn)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0014U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        switch(pll_idx) {
        case IDX_PLL0:
            /* reset the PLLFRAN and set according to pll_fracn */
            RCU_PLL0FRA &= ~(RCU_PLL0FRA_PLL0FRAN);
            RCU_PLL0FRA |= pll_fracn;
            break;
        case IDX_PLL1:
            /* reset the PLLFRAN and set according to pll_fracn */
            RCU_PLL1FRA &= ~(RCU_PLL1FRA_PLL1FRAN);
            RCU_PLL1FRA |= pll_fracn;
            break;
        case IDX_PLL2:
            /* reset the PLLFRAN and set according to pll_fracn */
            RCU_PLL2FRA &= ~(RCU_PLL2FRA_PLL2FRAN);
            RCU_PLL2FRA |= pll_fracn;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      PLL fractional latch enable (API_ID(0x0015U))
    \param[in]  pll_idx: IDX_PLL,IDX_PLLx (x = 0,1,2)
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_latch_enable(pll_idx_enum pll_idx)
{
    switch(pll_idx) {
    case IDX_PLL0:
        /* set the PLL0FRAEN */
        RCU_PLL0FRA |= RCU_PLL0FRA_PLL0FRAEN ;
        break;
    case IDX_PLL1:
        /* set the PLL1FRAEN */
        RCU_PLL1FRA |= RCU_PLL1FRA_PLL1FRAEN ;
        break;
    case IDX_PLL2:
        /* set the PLL2FRAEN */
        RCU_PLL2FRA |= RCU_PLL2FRA_PLL2FRAEN ;
        break;
    default:
        break;
    }
}

/*!
    \brief      PLL fractional latch disable (API_ID(0x0016U))
    \param[in]  pll_idx: IDX_PLL, IDX_PLLx (x = 1,2)
    \param[out] none
    \retval     none
*/
void rcu_pll_fractional_latch_disable(pll_idx_enum pll_idx)
{
    switch(pll_idx) {
    case IDX_PLL0:
        /* reset the PLL0FRAEN */
        RCU_PLL0FRA &= ~RCU_PLL0FRA_PLL0FRAEN ;
        break;
    case IDX_PLL1:
        /* reset the PLL1FRAEN */
        RCU_PLL1FRA &= ~RCU_PLL1FRA_PLL1FRAEN ;
        break;
    case IDX_PLL2:
        /* reset the PLL2FRAEN */
        RCU_PLL2FRA &= ~RCU_PLL2FRA_PLL2FRAEN ;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure PLL clock source (API_ID(0x0017U))
    \param[in]  pll_src: PLL clock source selection
      \arg        RCU_PLLSRC_IRC64MDIV: select IRC64MDIV as PLL source clock
      \arg        RCU_PLLSRC_LPIRC4M: select LPIRC4M as PLL source clock
      \arg        RCU_PLLSRC_HXTAL: select HXTAL as PLL source clock
    \param[out] none
    \retval     none
*/
void rcu_pll_source_config(uint32_t pll_src)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLL_SOURCE(pll_src)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0017U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* PLL clock source selection */
        RCU_PLLALL &= ~(RCU_PLLALL_PLLSEL);
        RCU_PLLALL |= pll_src;
    }
}

/*!
    \brief      configure the main PLL0 clock (API_ID(0x0018U))
    \param[in]  pll0_psc: the PLL0 VCO source clock prescaler
      \arg         this parameter should be selected between 1 and 63. When pll0_psc=0, the PLL0 VCO source clock prescaler close.
    \param[in]  pll0_n: the PLL0 VCO clock multi factor
      \arg        this parameter should be selected between 9 and 512
    \param[in]  pll0_p: the PLL0P output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll0_q: the PLL0 Q output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll0_r: the PLL0 R output frequency division factor from PLL0 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll0_config(uint32_t pll0_psc, uint32_t pll0_n, uint32_t pll0_p, uint32_t pll0_q, uint32_t pll0_r)
{
    /* check the function parameter */
    if(CHECK_PLL0_PSC_VALID(pll0_psc) && CHECK_PLL0_N_VALID(pll0_n) &&
            CHECK_PLL0_P_VALID(pll0_p) && CHECK_PLL0_Q_VALID(pll0_q) &&
            CHECK_PLL0_R_VALID(pll0_r)) {
        RCU_PLL0 &= ~(RCU_PLL0_PLL0PSC | RCU_PLL0_PLL0N | RCU_PLL0_PLL0P | RCU_PLL0_PLL0R);
        RCU_PLL0 |= pll0_psc | ((pll0_n - 1U) << RCU_PLLNOFFSET) | ((pll0_p - 1U) << RCU_PLLPOFFSET) |
                    ((pll0_r - 1U) << RCU_PLLROFFSET);
        RCU_PLLADDCTL &= ~RCU_PLLADDCTL_PLL0Q;
        RCU_PLLADDCTL |= (pll0_q - 1U);
    } else {
        /* return status */
        return ERROR;
    }

    /* return status */
    return SUCCESS;
}

/*!
    \brief      configure the PLL1 clock (API_ID(0x0019U))
    \param[in]  pll1_psc: the PLL1 VCO source clock prescaler
      \arg         this parameter should be selected between 1 and 63. When pll1_psc = 0,the PLL1 VCO source clock prescaler close.
    \param[in]  pll1_n: the PLL1 VCO clock multi factor
      \arg        this parameter should be selected between 9 and 512
    \param[in]  pll1_p: the PLL1 P output frequency division factor from PLL1 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll1_q: the PLL1 Q output frequency division factor from PLL1 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll1_r: the PLL1 R output frequency division factor from PLL1 VCO clock
      \arg        this parameter should be selected between 1 and 128

    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll1_config(uint32_t pll1_psc, uint32_t pll1_n, uint32_t pll1_p, uint32_t pll1_q, uint32_t pll1_r)
{
    /* check the function parameter */
    if(CHECK_PLL1_PSC_VALID(pll1_psc) && CHECK_PLL1_N_VALID(pll1_n) &&
            CHECK_PLL1_P_VALID(pll1_p) && CHECK_PLL1_Q_VALID(pll1_q) &&
            CHECK_PLL1_R_VALID(pll1_r)) {
        RCU_PLL1 = (pll1_psc | ((pll1_n - 1U) << RCU_PLLNOFFSET) | ((pll1_p - 1U) << RCU_PLLPOFFSET) |
                    ((pll1_r - 1U) << RCU_PLLROFFSET));
        RCU_PLLADDCTL &= ~RCU_PLLADDCTL_PLL1Q;
        RCU_PLLADDCTL |= ((pll1_q - 1U) << RCU_PLL1QOFFSET);
    } else {
        /* return status */
        return ERROR;
    }

    /* return status */
    return SUCCESS;
}

/*!
    \brief      configure the PLL2 clock (API_ID(0x001AU))
    \param[in]  pll2_psc: the PLL2 VCO source clock prescaler
      \arg         this parameter should be selected between 0 and 63. When pll2_psc = 0,the PLL2 VCO source clock prescaler close
    \param[in]  pll2_n: the PLL2 VCO clock multi factor
      \arg        this parameter should be selected between 9 and 512
    \param[in]  pll2_p: the PLL2 P output frequency division factor from PLL2 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll2_q: the PLL2 Q output frequency division factor from PLL2 VCO clock
      \arg        this parameter should be selected between 1 and 128
    \param[in]  pll2_r: the PLL2 R output frequency division factor from PLL2 VCO clock
      \arg        this parameter should be selected between 1 and 128

    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus rcu_pll2_config(uint32_t pll2_psc, uint32_t pll2_n, uint32_t pll2_p, uint32_t pll2_q, uint32_t pll2_r)
{
    /* check the function parameter */
    if(CHECK_PLL2_PSC_VALID(pll2_psc) && CHECK_PLL2_N_VALID(pll2_n) &&
            CHECK_PLL2_P_VALID(pll2_p) && CHECK_PLL2_R_VALID(pll2_q) &&
            CHECK_PLL2_R_VALID(pll2_r)) {
        RCU_PLL2 = (pll2_psc | ((pll2_n - 1U) << RCU_PLLNOFFSET) | ((pll2_p - 1U) << RCU_PLLPOFFSET) |
                    ((pll2_r - 1U) << RCU_PLLROFFSET));
        RCU_PLLADDCTL &= ~RCU_PLLADDCTL_PLL2Q;
        RCU_PLLADDCTL |= ((pll2_q - 1U) << RCU_PLL2QOFFSET);
    } else {
        /* return status */
        return ERROR;
    }

    /* return status */
    return SUCCESS;
}

/*!
    \brief      enable the pllp pllq pllr divider output (API_ID(0x001BU))
    \param[in]  pllxy: the output pll enable
      \arg        RCU_PLL0P: PLL0P divider output enable
      \arg        RCU_PLL0Q: PLL0Q divider output enable
      \arg        RCU_PLL0R: PLL0R divider output enable
      \arg        RCU_PLL1P: PLL1P divider output enable
      \arg        RCU_PLL1Q: PLL1Q divider output enable
      \arg        RCU_PLL1R: PLL1R divider output enable
      \arg        RCU_PLL2P: PLL2P divider output enable
      \arg        RCU_PLL2Q: PLL2Q divider output enable
      \arg        RCU_PLL2R: PLL2R divider output enable
    \param[out] none
    \retval     none
*/
void rcu_pll_clock_output_enable(uint32_t pllxy)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLLPQR_DIVIDER(pllxy)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* PLL divider output enable */
        RCU_PLLADDCTL |= pllxy;
    }
}

/*!
    \brief      disable the pllp pllq pllr divider output (API_ID(0x001CU))
    \param[in]  pllxy: the output pll disable
      \arg        RCU_PLL0P: PLL0P divider output disable
      \arg        RCU_PLL0Q: PLL0Q divider output disable
      \arg        RCU_PLL0R: PLL0R divider output disable
      \arg        RCU_PLL1P: PLL1P divider output disable
      \arg        RCU_PLL1Q: PLL1Q divider output disable
      \arg        RCU_PLL1R: PLL1R divider output disable
      \arg        RCU_PLL2P: PLL2P divider output disable
      \arg        RCU_PLL2Q: PLL2Q divider output disable
      \arg        RCU_PLL2R: PLL2R divider output disable
    \param[out] none
    \retval     none
*/
void rcu_pll_clock_output_disable(uint32_t pllxy)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLLPQR_DIVIDER(pllxy)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* PLL divider output disable */
        RCU_PLLADDCTL &= ~(pllxy);
    }
}

/*!
    \brief      configure the PLLUSBHS0 clock (API_ID(0x001DU))
    \param[in]  pllusb_presel: PLLUSBHSPRE clock selection
      \arg        this parameter should be selected RCU_PLLUSBHSPRE_HXTAL or RCU_PLLUSBHSPRE_IRC48M
    \param[in]  pllusb_predv: the divider factor from PLLUSBHS clock
      \arg        this parameter should be selected between RCU_PLLUSBHSPRE_DIVx (x = 1...15)
    \param[in]  pllusb_mf: PLLUSBHS0 clock multiplication factor
      \arg        this parameter should be selected RCU_PLLUSBHS_MULx (x = 16,17...127)
    \param[in]  usbhsdv: the divider factor from USBHSDV clock
      \arg        this parameter should be selected RCU_USBHS_DIVx (x = 2,4...16)

    \param[out] none
    \retval     none
*/
void rcu_pllusb0_config(uint32_t pllusb_presel, uint32_t pllusb_predv, uint32_t pllusb_mf, uint32_t usbhsdv)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLLUSB_PRESEL(pllusb_presel)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_PLLUSBHS_DIVIDER(pllusb_predv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_PLLUSBHS_MULTI(pllusb_mf)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_USBHS_DIVIDER(usbhsdv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* configure PLLUSBHS source selection */
        RCU_USBCLKCTL &= ~(RCU_USBCLKCTL_PLLUSBHS0PRESEL);
        RCU_USBCLKCTL |= (pllusb_presel);

        RCU_PLLUSBCFG &= ~(RCU_PLLUSBCFG_PLLUSBHS0PREDV | RCU_PLLUSBCFG_USBHS0DV | RCU_PLLUSBCFG_PLLUSBHS0MF);
        RCU_PLLUSBCFG |= (pllusb_predv | usbhsdv | pllusb_mf);
    }
}

/*!
    \brief      configure the PLLUSBHS1 clock (API_ID(0x001EU))
    \param[in]  pllusb_presel: PLLUSBHSPRE clock selection
      \arg        this parameter should be selected RCU_PLLUSBHSPRE_HXTAL or RCU_PLLUSBHSPRE_IRC48M
    \param[in]  pllusb_predv: the divider factor from PLLUSBHS clock
      \arg        this parameter should be selected between RCU_PLLUSBHSPRE_DIVx (x = 1...15)
    \param[in]  pllusb_mf: PLLUSBHS1 clock multiplication factor
      \arg        this parameter should be selected RCU_PLLUSBHS_MULx (x = 16,17..127)
    \param[in]  usbhsdv: the divider factor from USBHSDV clock
      \arg        this parameter should be selected RCU_USBHS_DIVx (x = 2,4...16)

    \param[out] none
    \retval     none
*/
void rcu_pllusb1_config(uint32_t pllusb_presel, uint32_t pllusb_predv, uint32_t pllusb_mf, uint32_t usbhsdv)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLLUSB_PRESEL(pllusb_presel)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_PLLUSBHS_DIVIDER(pllusb_predv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_PLLUSBHS_MULTI(pllusb_mf)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else if(NOT_RCU_USBHS_DIVIDER(usbhsdv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* configure pllusb source selection */
        RCU_USBCLKCTL &= ~(RCU_USBCLKCTL_PLLUSBHS1PRESEL);
        RCU_USBCLKCTL |= ((pllusb_presel << 8U));

        RCU_PLLUSBCFG &= ~(RCU_PLLUSBCFG_PLLUSBHS1PREDV | RCU_PLLUSBCFG_USBHS1DV | RCU_PLLUSBCFG_PLLUSBHS1MF);
        RCU_PLLUSBCFG |= ((pllusb_predv << 16U) | (usbhsdv << 16U) | (pllusb_mf << 16U));
    }
}

/*!
    \brief      configure the RTC clock source selection (API_ID(0x001FU))
    \param[in]  rtc_clock_source: RTC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTCSRC_NONE: no clock selected
      \arg        RCU_RTCSRC_LXTAL: CK_LXTAL selected as RTC source clock
      \arg        RCU_RTCSRC_IRC32K: CK_IRC32K selected as RTC source clock
      \arg        RCU_RTCSRC_HXTAL_DIV_RTCDIV: CK_HXTAL / RTCDIV selected as RTC source clock
    \param[out] none
    \retval     none
*/
void rcu_rtc_clock_config(uint32_t rtc_clock_source)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_RTC_CLOCK_SOURCE(rtc_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x001FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_BDCTL;
        /* reset the RTCSRC bits and set according to rtc_clock_source */
        reg &= ~RCU_BDCTL_RTCSRC;
        RCU_BDCTL = (reg | rtc_clock_source);
    }
}

/*!
    \brief      configure the frequency division of RTC clock when HXTAL was selected as its clock source (API_ID(0x0020U))
    \param[in]  rtc_div: RTC clock frequency division
                only one parameter can be selected which is shown as below:
      \arg        RCU_RTC_HXTAL_NONE: no clock for RTC
      \arg        RCU_RTC_HXTAL_DIVx: RTCDIV clock select CK_HXTAL / x (x = 2,3...63)
    \param[out] none
    \retval     none
*/
void rcu_rtc_div_config(uint32_t rtc_div)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_RTC_DIVIDER(rtc_div)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_CFG0;
        /* reset the RTCDIV bits and set according to rtc_div value */
        reg &= ~RCU_CFG0_RTCDIV;
        RCU_CFG0 = (reg | rtc_div);
    }
}

/*!
    \brief      configure the CK48M clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x0021U))
    \param[in]  ck48m_clock_source: CK48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CK48MSRC_PLL48M: CK_PLL48M selected as CK48M source clock
      \arg        RCU_CK48MSRC_IRC48M: CK_IRC48M selected as CK48M source clock
    \param[out] none
    \retval     none
*/
void rcu_ck48m_clock_config(uint32_t ck48m_clock_source)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_CK48M_CLOCK_SOURCE(ck48m_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_ADDCTL0;
        /* reset the CK48MSEL bit and set according to ck48m_clock_source */
        reg &= ~RCU_ADDCTL0_CK48MSEL;
        RCU_ADDCTL0 = (reg | ck48m_clock_source);
    }
}

/*!
    \brief      configure the PLL48M clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x0022U))
    \param[in]  pll48m_clock_source: PLL48M clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PLL48MSRC_PLL0Q: CK_PLL0Q selected as PLL48M source clock
      \arg        RCU_PLL48MSRC_PLL2P: CK_PLL2P selected as PLL48M source clock
    \param[out] none
    \retval     none
*/
void rcu_pll48m_clock_config(uint32_t pll48m_clock_source)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PLL48M_CLOCK_SOURCE(pll48m_clock_source)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_ADDCTL0;
        /* reset the PLL48MSEL bit and set according to pll48m_clock_source */
        reg &= ~RCU_ADDCTL0_PLL48MSEL;
        RCU_ADDCTL0 = (reg | pll48m_clock_source);
    }
}

/*!
    \brief      configure the IRC64M clock divider selection (API_ID(0x0023U))
    \param[in]  ck_irc64mdiv: IRC64M clock divider selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC64M_DIV1: CK_IRC64M / 1
      \arg        RCU_IRC64M_DIV2: CK_IRC64M / 2
      \arg        RCU_IRC64M_DIV4: CK_IRC64M / 4
      \arg        RCU_IRC64M_DIV8: CK_IRC64M / 8
    \param[out] none
    \retval     none
*/
void rcu_irc64mdiv_clock_config(uint32_t ck_irc64mdiv)
{
    uint32_t reg;

