RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_rcu.c
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_IRC64M_CLOCK_DIV(ck_irc64mdiv)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0023U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_ADDCTL1;
        /* reset the IRC64MDIV and set according to ck_irc64mdiv */
        reg &= ~RCU_ADDCTL1_IRC64MDIV;
        RCU_ADDCTL1 = (reg | ck_irc64mdiv);
    }
}
/*!
    \brief    get the irc64mdiv clock (API_ID(0x0024U))
    \param[in]  none
    \param[out] none
    \retval     clock frequency of irc64mdiv: 64000000, 32000000, 16000000, 8000000
*/
uint32_t rcu_irc64mdiv_freq_get(void)
{
    uint32_t irc64m_freq = 0U;

    /* CK_IRC64MDIV = CK_IRC64M/1/2/4/8 */
    if(RCU_IRC64M_DIV1 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE;
    } else if(RCU_IRC64M_DIV2 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE / 2U;
    } else if(RCU_IRC64M_DIV4 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE / 4U;
    } else if(RCU_IRC64M_DIV8 == (RCU_ADDCTL1 & RCU_ADDCTL1_IRC64MDIV)) {
        irc64m_freq = IRC64M_VALUE / 8U;
    } else {
    }

    return irc64m_freq;
}

/*!
    \brief      configure the TIMER clock prescaler selection (API_ID(0x0025U))
    \param[in]  timer_clock_prescaler: TIMER clock selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_TIMER_PSC_MUL2: if APB1PSC / APB2PSC in RCU_CFG0 register is 0b0xx (CK_APBx = CK_AHB)
                                      or 0b100 (CK_APBx = CK_AHB / 2), the TIMER clock is equal to CK_AHB (CK_TIMERx = CK_AHB).
                                      or else, the TIMER clock is twice the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 2 x CK_APB1;
                                      TIMER in APB2 domain: CK_TIMERx = 2 x CK_APB2)
      \arg        RCU_TIMER_PSC_MUL4: if APB1PSC / APB2PSC in RCU_CFG0 register is 0b0xx(CK_APBx = CK_AHB),
                                      0b100 (CK_APBx = CK_AHB / 2), or 0b101 (CK_APBx = CK_AHB / 4), the TIMER clock is equal to CK_AHB (CK_TIMERx = CK_AHB).
                                      or else, the TIMER clock is four timers the corresponding APB clock (TIMER in APB1 domain: CK_TIMERx = 4 x CK_APB1;
                                      TIMER in APB2 domain: CK_TIMERx = 4 x CK_APB2)
    \param[out] none
    \retval     none
*/
void rcu_timer_clock_prescaler_config(uint32_t timer_clock_prescaler)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_TIMER_PRE_SEL(timer_clock_prescaler)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0025U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* configure the TIMERSEL bit and select the TIMER clock prescaler */
        if(timer_clock_prescaler == RCU_TIMER_PSC_MUL2) {
            RCU_CFG1 &= timer_clock_prescaler;
        } else {
            RCU_CFG1 |= timer_clock_prescaler;
        }
    }
}

/*!
    \brief      configure the SPI / I2S clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x0026U))
    \param[in]  spi_idx: IDX_SPIx (x = 0,1,2,3,4,5)
    \param[in]  ck_spi: SPI0 / SPI1 / SPI2 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SPISRC_PLL0Q: CK_SPI select PLL0Q
      \arg        RCU_SPISRC_PLL1P: CK_SPI select PLL1P
      \arg        RCU_SPISRC_PLL2P: CK_SPI select PLL2P
      \arg        RCU_SPISRC_I2S_CKIN: CK_SPI select I2SCKIN
      \arg        RCU_SPISRC_PER: CK_SPI select PER
    \param[in]  ck_spi: SPI3 / SPI4 / SPI5 clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_SPISRC_APB2: CK_SPI select CKAPB2
      \arg        RCU_SPISRC_PLL1Q: CK_SPI select PLL1Q
      \arg        RCU_SPISRC_PLL2Q: CK_SPI select PLL2Q
      \arg        RCU_SPISRC_IRC64MDIV: CK_SPI select IRC64MDIV
      \arg        RCU_SPISRC_LPIRC4M: CK_SPI select LPIRC4M
      \arg        RCU_SPISRC_HXTAL: CK_SPI select HXTAL
      \arg        RCU_SPI5SRC_I2S_CKIN: CK_SPI select I2SCKIN (only for SPI5)
    \param[out] none
    \retval     none
*/
void rcu_spi_clock_config(spi_idx_enum spi_idx, uint32_t ck_spi)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_SPISRC_SEL(ck_spi)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0026U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(spi_idx) {
        case IDX_SPI0:
            /* reset the SPI0SEL bits and set according to ck_spi */
            RCU_CFG5 &= ~RCU_CFG5_SPI0SEL;
            RCU_CFG5 |= (uint32_t)ck_spi ;
            break;
        case IDX_SPI1:
            /* reset the SPI1SEL bits and set according to ck_spi */
            RCU_CFG5 &= ~RCU_CFG5_SPI1SEL;
            RCU_CFG5 |= (uint32_t)ck_spi << 4U ;
            break;
        case IDX_SPI2:
            /* reset the SPI2SEL bits and set according to ck_spi */
            RCU_CFG5 &= ~RCU_CFG5_SPI2SEL;
            RCU_CFG5 |= (uint32_t)ck_spi << 8U;
            break;
        case IDX_SPI3:
            /* reset the SPI3SEL bits and set according to ck_spi */
            RCU_CFG5 &= ~RCU_CFG5_SPI3SEL;
            RCU_CFG5 |= (uint32_t)ck_spi ;
            break;
        case IDX_SPI4:
            /* reset the SPI4SEL bits and set according to ck_spi */
            RCU_CFG5 &= ~RCU_CFG5_SPI4SEL;
            RCU_CFG5 |= (uint32_t)ck_spi << 4U;
            break;
        case IDX_SPI5:
            /* reset the SPI5SEL bits and set according to ck_spi */
            RCU_CFG5 &= ~RCU_CFG5_SPI5SEL;
            RCU_CFG5 |= (uint32_t)ck_spi << 8U;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the Deep-sleep wakeup system clock source selection (API_ID(0x0027U))
    \param[in]  ck_dspwussel: Deep-sleep wakeup system clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_DSPWUSSEL_IRC64MDIV: ck_dspwussel select IRC64MDIV
      \arg        RCU_DSPWUSSEL_LPIRC4M: ck_dspwussel select LPIRC4M
    \param[out] none
    \retval     none
*/
void rcu_deepsleep_wakeup_sys_clock_config(uint32_t ck_dspwussel)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_DSPWUSSEL(ck_dspwussel)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0027U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* reset the DSPWUSSEL bits and set according to ck_dspwussel */
        RCU_CFG3 &= ~RCU_CFG3_DSPWUSSEL;
        RCU_CFG3 |= ck_dspwussel;
    }
}

/*!
    \brief      configure the USARTx (x = 0,1,2,5) clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x0028U))
    \param[in]  usart_idx: IDX_USARTx (x = 0,1,2,5)
    \param[in]  ck_usart: USART clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USARTSRC_APB: CK_USART select CK_APB1(USART1 / USART2) or CK_APB2(USART0 / USART5)
      \arg        RCU_USARTSRC_AHB: CK_USART select CK_AHB
      \arg        RCU_USARTSRC_LXTAL: CK_USART select CK_LXTAL
      \arg        RCU_USARTSRC_IRC64MDIV: CK_USART select CK_IRC64MDIV
    \param[out] none
    \retval     none
*/
void rcu_usart_clock_config(usart_idx_enum usart_idx, uint32_t ck_usart)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_USARTSRC_SEL(ck_usart)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(usart_idx) {
        case IDX_USART0:
            /* reset the USART0SEL bits and set according to ck_usart */
            RCU_CFG1 &= ~RCU_CFG1_USART0SEL;
            RCU_CFG1 |= ck_usart;
            break;
        case IDX_USART1:
            /* reset the USART1SEL bits and set according to ck_usart */
            RCU_CFG1 &= ~RCU_CFG1_USART1SEL;
            RCU_CFG1 |= (uint32_t)ck_usart << 18U;
            break;
        case IDX_USART2:
            /* reset the USART2SEL bits and set according to ck_usart */
            RCU_CFG1 &= ~RCU_CFG1_USART2SEL;
            RCU_CFG1 |= (uint32_t)ck_usart << 20U;
            break;
        case IDX_USART5:
            /* reset the USART5SEL bits and set according to ck_usart */
            RCU_CFG1 &= ~RCU_CFG1_USART5SEL;
            RCU_CFG1 |= (uint32_t)ck_usart << 22U;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the I2Cx (x = 0,1,2,3) clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x0029U))
    \param[in]  i2c_idx: IDX_I2Cx (x = 0,1,2,3)
    \param[in]  ck_i2c: I2C clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_I2CSRC_APB1: CK_I2C select CK_APB1
      \arg        RCU_I2CSRC_PLL2R: CK_I2C select CK_PLL2R
      \arg        RCU_I2CSRC_IRC64MDIV: CK_I2C select CK_IRC64MDIV
      \arg        RCU_I2CSRC_LPIRC4M: CK_I2C select CK_LPIRC4M
    \param[out] none
    \retval     none
*/
void rcu_i2c_clock_config(i2c_idx_enum i2c_idx, uint32_t ck_i2c)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_I2CSRC_SEL(ck_i2c)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0029U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(i2c_idx) {
        case IDX_I2C0:
            /* reset the I2C0SEL bits and set according to ck_i2c */
            RCU_CFG0 &= ~RCU_CFG0_I2C0SEL;
            RCU_CFG0 |= ck_i2c << 30U;
            break;
        case IDX_I2C1:
            /* reset the I2C1SEL bits and set according to ck_i2c */
            RCU_CFG3 &= ~RCU_CFG3_I2C1SEL;
            RCU_CFG3 |= (uint32_t)ck_i2c;
            break;
        case IDX_I2C2:
            /* reset the I2C2SEL bits and set according to ck_i2c */
            RCU_CFG3 &= ~RCU_CFG3_I2C2SEL;
            RCU_CFG3 |= (uint32_t)ck_i2c << 2U;
            break;
        case IDX_I2C3:
            /* reset the I2C4SEL bits and set according to ck_i2c */
            RCU_CFG3 &= ~RCU_CFG3_I2C3SEL;
            RCU_CFG3 |= (uint32_t)ck_i2c << 4U;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the CANx (x = 0,1,2) clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x002AU))
    \param[in]  can_idx: IDX_CANx (x = 0,1,2)
    \param[in]  ck_can: CAN clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_CANSRC_HXTAL: CK_CAN select CK_HXTAL
      \arg        RCU_CANSRC_APB2: CK_CAN select CK_APB2
      \arg        RCU_CANSRC_APB2_DIV2: CK_CAN select CK_APB2 / 2
      \arg        RCU_CANSRC_IRC64MDIV: CK_CAN select CK_IRC64MDIV
    \param[out] none
    \retval     none
*/
void rcu_can_clock_config(can_idx_enum can_idx, uint32_t ck_can)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_CANSRC_SEL(ck_can)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002AU), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(can_idx) {
        case IDX_CAN0:
            /* reset the CAN0SEL bits and set according to ck_can */
            RCU_CFG1 &= ~RCU_CFG1_CAN0SEL;
            RCU_CFG1 |= ck_can ;
            break;
        case IDX_CAN1:
            /* reset the CAN1SEL bits and set according to ck_can */
            RCU_CFG1 &= ~RCU_CFG1_CAN1SEL;
            RCU_CFG1 |= (uint32_t)ck_can << 2U;
            break;
        case IDX_CAN2:
            /* reset the CAN2SEL bits and set according to ck_can */
            RCU_CFG1 &= ~RCU_CFG1_CAN2SEL;
            RCU_CFG1 |= (uint32_t)ck_can << 4U;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the ADCx (x = 0,1,2) clock source selection (API_ID(0x002BU))
    \param[in]  adc_idx: IDX_ADCx (x = 0,1,2)
    \param[in]  ck_adc: ADC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_ADCSRC_PLL1P: CK_ADC select CK_PLL1P
      \arg        RCU_ADCSRC_PLL2R: CK_ADC select CK_PLL2R
      \arg        RCU_ADCSRC_PER: CK_ADC select CK_PER
    \param[out] none
    \retval     none
*/
void rcu_adc_clock_config(adc_idx_enum adc_idx, uint32_t ck_adc)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_ADCSRC_SEL(ck_adc)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002BU), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(adc_idx) {
        case IDX_ADC0:
        case IDX_ADC1:
            /* reset the ADC0SEL/ADC1SEL bits and set according to ck_adc */
            RCU_CFG3 &= ~RCU_CFG3_ADC01SEL;
            RCU_CFG3 |= ck_adc ;
            break;
        case IDX_ADC2:
            /* reset the ADC2SEL bits and set according to ck_adc */
            RCU_CFG3 &= ~RCU_CFG3_ADC2SEL;
            RCU_CFG3 |= (uint32_t)ck_adc << 2U;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the EXMC clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x002CU))
    \param[in]  ck_exmc: EXMC clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_EXMCSRC_AHB: CK_EXMC select CK_AHB
      \arg        RCU_EXMCSRC_PLL0Q: CK_EXMC select CK_PLL0Q
      \arg        RCU_EXMCSRC_PLL1R: CK_EXMC select CK_PLL1R
      \arg        RCU_EXMCSRC_PER: CK_EXMC select CK_PER
    \param[out] none
    \retval     none
*/
void rcu_exmc_clock_config(uint32_t ck_exmc)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_EXMCSRC_SEL(ck_exmc)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* reset the EXMCSEL bits and set according to ck_exmc */
        RCU_CFG4 &= ~(RCU_CFG4_EXMCSEL);
        RCU_CFG4 |= ck_exmc ;
    }
}

/*!
    \brief      configure the HPDF audio clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x002DU))
    \param[in]  ck_hpdfa: HPDF audio clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFASRC_PLL0Q: CK_HPDFAUDIO select CK_PLL0Q
      \arg        RCU_HPDFASRC_PLL1P: CK_HPDFAUDIO select CK_PLL2R
      \arg        RCU_HPDFASRC_PLL2P: CK_HPDFAUDIO select CK_PLL2P
      \arg        RCU_HPDFASRC_I2S_CKIN: CK_HPDFAUDIO select CK_PLL2R
      \arg        RCU_HPDFASRC_PER: CK_HPDFAUDIO select CK_PER
    \param[out] none
    \retval     none
*/
void rcu_hpdf_audio_clock_config(uint32_t ck_hpdfa)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_HPDFASRC_SEL(ck_hpdfa)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* reset the HPDFASEL bits and set according to ck_hpdfa */
        RCU_CFG2 &= ~RCU_CFG2_HPDFASEL;
        RCU_CFG2 |= ck_hpdfa ;
    }
}

/*!
    \brief      configure the HPDF clock source selection (need to check the target clock whether to ready before enabling or switching dynamically) (API_ID(0x002EU))
    \param[in]  ck_hpdf: HPDF clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_HPDFSRC_APB2: CK_HPDF select CK_APB2
      \arg        RCU_HPDFSRC_AHB: CK_HPDF select CK_AHB
    \param[out] none
    \retval     none
*/
void rcu_hpdf_clock_config(uint32_t ck_hpdf)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_HPDFSRC_SEL(ck_hpdf)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* reset the HPDFSEL bits and set according to ck_hpdf */
        RCU_CFG1 &= ~RCU_CFG1_HPDFSEL;
        RCU_CFG1 |= ck_hpdf ;
    }
}

/*!
    \brief      configure the PER clock source selection (API_ID(0x002FU))
    \param[in]  ck_per: PER clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_PERSRC_IRC64MDIV: CK_PER select CK_IRC64MDIV
      \arg        RCU_PERSRC_LPIRC4M: CK_PER select CK_LPIRC4M
      \arg        RCU_PERSRC_HXTAL: CK_PER select CK_HXTAL
    \param[out] none
    \retval     none
*/
void rcu_per_clock_config(uint32_t ck_per)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_PERSRC_SEL(ck_per)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x002FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* reset the PERSEL bits and set according to ck_per */
        RCU_CFG1 &= ~RCU_CFG1_PERSEL;
        RCU_CFG1 |= ck_per ;
    }
}

/*!
    \brief      configure the PLL1Q prescaler (API_ID(0x0030U))
    \param[in]  usbhs_idx: IDX_USBHSx (x = 0,1)
    \param[in]  ck_usbhspsc: USBHS clock prescaler from CK_PLL1Q
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBHSPSC_DIV1: CK_PLL1Q / 1
      \arg        RCU_USBHSPSC_DIV2: CK_PLL1Q / 2
      \arg        RCU_USBHSPSC_DIV3: CK_PLL1Q / 3
      \arg        RCU_USBHSPSC_DIV4: CK_PLL1Q / 4
      \arg        RCU_USBHSPSC_DIV5: CK_PLL1Q / 5
      \arg        RCU_USBHSPSC_DIV6: CK_PLL1Q / 6
      \arg        RCU_USBHSPSC_DIV7: CK_PLL1Q / 7
      \arg        RCU_USBHSPSC_DIV8: CK_PLL1Q / 8
    \param[out] none
    \retval     none
*/
void rcu_usbhs_pll1qpsc_config(usbhs_idx_enum usbhs_idx, uint32_t ck_usbhspsc)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_USBHSPSC(ck_usbhspsc)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0030U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(usbhs_idx) {
        case IDX_USBHS0:
            /* reset the USBHS0PSC bits and set according to ck_usbhspsc */
            RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS0PSC;
            RCU_USBCLKCTL |= ck_usbhspsc ;
            break;
        case IDX_USBHS1:
            /* reset the USBHS1PSC bits and set according to ck_usbhspsc */
            RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS1PSC;
            RCU_USBCLKCTL |= (ck_usbhspsc << 3U) ;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the USBHS48MSEL clock source selection (API_ID(0x0031U))
    \param[in]  usbhs_idx: IDX_USBHSx (x = 0,1)
    \param[in]  ck_usb48m: USBHS48MSEL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USB48MSRC_PLL0R: CK_USB48M select CK_PLL0R
      \arg        RCU_USB48MSRC_PLLUSBHS: CK_USB48M select CK_PLLUSBHSx / USBHxSDV
      \arg        RCU_USB48MSRC_PLL1Q: CK_USB48M select CK_PLL1Q / USBHSxPSC
      \arg        RCU_USB48MSRC_IRC48M: CK_USB48M select CK_IRC48M
    \param[out] none
    \retval     none
*/
void rcu_usb48m_clock_config(usbhs_idx_enum usbhs_idx, uint32_t ck_usb48m)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_USB48MSRC_SEL(ck_usb48m)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0031U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(usbhs_idx) {
        case IDX_USBHS0:
            /* reset the USB048MSEL bits and set according to ck_usb48m */
            RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS048MSEL;
            RCU_USBCLKCTL |= ck_usb48m ;
            break;
        case IDX_USBHS1:
            /* reset the USB148MSEL bits and set according to ck_usb48m */
            RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS148MSEL;
            RCU_USBCLKCTL |= (ck_usb48m << 8U) ;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure the USBHSSEL clock source selection (API_ID(0x0032U))
    \param[in]  usbhs_idx: IDX_USBHSx (x = 0,1)
    \param[in]  ck_usbhs: USBHSSEL clock source selection
                only one parameter can be selected which is shown as below:
      \arg        RCU_USBHSSEL_48M: CK_USBHS select 48M
      \arg        RCU_USBHSSEL_60M: CK_USBHS select 60M
    \param[out] none
    \retval     none
*/
void rcu_usbhs_clock_config(usbhs_idx_enum usbhs_idx, uint32_t ck_usbhs)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_USBHS_SEL(ck_usbhs)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0032U), ERR_PARAM_INVALID);
    } else
#endif
    {
        switch(usbhs_idx) {
        case IDX_USBHS0:
            /* reset the USBHS0SEL bits and set according to ck_usbhs */
            RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS0SEL;
            RCU_USBCLKCTL |= ck_usbhs ;
            break;
        case IDX_USBHS1:
            /* reset the USBHS1SEL bits and set according to ck_usbhs */
            RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS1SEL;
            RCU_USBCLKCTL |= (ck_usbhs << 8U) ;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      enable the USBHS clock source selection (API_ID(0x0033U))
    \param[in]  usbhs_idx: IDX_USBHSx (x = 0,1)
    \param[out] none
    \retval     none
*/
void rcu_usbhs_clock_selection_enable(usbhs_idx_enum usbhs_idx)
{
    switch(usbhs_idx) {
    case IDX_USBHS0:
        /* set the USB0SWEN bit  */
        RCU_USBCLKCTL |= RCU_USBCLKCTL_USBHS0SWEN;
        break;
    case IDX_USBHS1:
        /* set the USB1SWEN bit */
        RCU_USBCLKCTL |= RCU_USBCLKCTL_USBHS1SWEN;
        break;
    default:
        break;
    }
}

/*!
    \brief      disable the USBHS clock source selection (API_ID(0x0034U))
    \param[in]  usbhs_idx: IDX_USBxHS (x = 0,1)
    \param[out] none
    \retval     none
*/
void rcu_usbhs_clock_selection_disable(usbhs_idx_enum usbhs_idx)
{
    switch(usbhs_idx) {
    case IDX_USBHS0:
        /* reset the USB0SWEN bit  */
        RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS0SWEN;
        break;
    case IDX_USBHS1:
        /* reset the USB1SWEN bit */
        RCU_USBCLKCTL &= ~RCU_USBCLKCTL_USBHS1SWEN;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure the LXTAL drive capability (API_ID(0x0035U))
    \param[in]  lxtal_dricap: drive capability of LXTAL
                only one parameter can be selected which is shown as below:
      \arg        RCU_LXTAL_LOWDRI: lower driving capability
      \arg        RCU_LXTAL_MED_LOWDRI: middle driving capability
      \arg        RCU_LXTAL_MED_HIGHDRI: higher driving capability
      \arg        RCU_LXTAL_HIGHDRI: stronger driving capability
    \param[out] none
    \retval     none
*/
void rcu_lxtal_drive_capability_config(uint32_t lxtal_dricap)
{
    uint32_t reg;

    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_RCU_LXTAL_DRICAP_SEL(lxtal_dricap)) {
        fw_debug_report_err(RCU_MODULE_ID, API_ID(0x0035U), ERR_PARAM_INVALID);
    } else
#endif
    {
        reg = RCU_BDCTL;

        /* reset the LXTALDRI bits and set according to lxtal_dricap */
        reg &= ~RCU_BDCTL_LXTALDRI;
        RCU_BDCTL = (reg | lxtal_dricap);
    }
}

